import UIKit

class ControllerLab4: UIViewController{
    
    @IBAction func showTask(_ sender: UIButton) {
        Util.showAlert(alertTitle: "Задание к работе 4", alertMessage: "Написати програму під платформу Андроїд/iOS, яка має інтерфейс для запуску аудіо- файлів та відео-файлів. Мінімально інтерфейс має три кнопки Програти, Зупинити, Призупинити для відтворення відео-файлу або аудіо-файлу, який зберігається на мобільному пристрою. Додатково можливо розширити функціональність наступним:\n-надати вибір завантаження будь-якого файлу з деякого списку на мобільному пристрою;\n- надати обрати тип файлу для відтворення (аудіо або відео);\n- надати вибір завантаження файлу з Інтернет;\n- використовувати для реалізації обробки медіа-даних спеціалізованих інструментів.\nПримітка: конкретного варіанту лабораторної роботи непередбачено, студент сам формує функціональність програми.", controller: self)
    }
    
    @IBAction func showInstruction(_ sender: UIButton) {
        Util.showAlert(alertTitle: "Инструкция к работе 1", alertMessage: "Шаг 1: Введите текст в поле для ввода\nШаг 2: Выставьте слайдер в желаемое положение\nШаг 3: Нажмите кнопку ОК\nШаг 4: Нажмите кнопку Cancel, чтобы очистить поля и начать заново\nПодсказка: Чтобы использовать клавиатуру телефона нажмите cmd+K", controller: self)
    }
    
}
